2013-02-20 15:34:12	127.0.0.1	error	2013-02-20 15:34:12	127.0.0.1	[18]	Unknown module in the selector "form:ProjetDevWeb~lignes"	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\selector\jSelectorForm.class.php	42
	/Projet_ITI/www/index.php
array ( )

	0	jSelectorForm->_createPath()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\selector\jSelectorModule.class.php : 44
	1	jSelectorModule->__construct()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\selector\jSelectorForm.class.php : 32
	2	jSelectorForm->__construct()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\forms\jForms.class.php : 53
	3	jForms::create()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php : 30
	4	defaultCtrl->index()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	5	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-02-20 15:34:56	127.0.0.1	error	2013-02-20 15:34:56	127.0.0.1	[18]	Unknown module in the selector "form:ProjetDevWeb~utilisateurs"	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\selector\jSelectorForm.class.php	42
	/Projet_ITI/www/index.php
array ( )

	0	jSelectorForm->_createPath()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\selector\jSelectorModule.class.php : 44
	1	jSelectorModule->__construct()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\selector\jSelectorForm.class.php : 32

2013-04-20 21:40:12	127.0.0.1	notice	2013-04-20 21:40:12	127.0.0.1	[8]	Trying to get property of non-object	C:\Program Files\EasyPHP-12.1\www\temp\Projet_ITI\www\compiled\templates\modules\Projet_ITI\AfficherAnnonces_html_t.php	50
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces
array (   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	template_49dcb02207c226ea7c0a9641618442f7()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTpl.class.php : 284
	1	jTpl->fetch()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\response\jResponseHtml.class.php : 191
	2	jResponseHtml->output()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 204
	3	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-20 21:40:12	127.0.0.1	notice	2013-04-20 21:40:12	127.0.0.1	[8]	Undefined index: COURANTANNONCES	C:\Program Files\EasyPHP-12.1\www\temp\Projet_ITI\www\compiled\templates\modules\Projet_ITI\AfficherAnnonces_html_t.php	50
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces
array (   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	template_49dcb02207c226ea7c0a9641618442f7()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTpl.class.php : 284
	1	jTpl->fetch()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\response\jResponseHtml.class.php : 191
	2	jResponseHtml->output()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 204
	3	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-20 21:40:12	127.0.0.1	notice	2013-04-20 21:40:12	127.0.0.1	[8]	Trying to get property of non-object	C:\Program Files\EasyPHP-12.1\www\temp\Projet_ITI\www\compiled\templates\modules\Projet_ITI\AfficherAnnonces_html_t.php	50
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces
array (   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	template_49dcb02207c226ea7c0a9641618442f7()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTpl.class.php : 284
	1	jTpl->fetch()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\response\jResponseHtml.class.php : 191
	2	jResponseHtml->output()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 204
	3	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-20 21:40:12	127.0.0.1	notice	2013-04-20 21:40:12	127.0.0.1	[8]	Undefined index: COURANTANNONCES	C:\Program Files\EasyPHP-12.1\www\temp\Projet_ITI\www\compiled\templates\modules\Projet_ITI\AfficherAnnonces_html_t.php	50
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces
array (   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	template_49dcb02207c226ea7c0a9641618442f7()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTpl.class.php : 284
	1	jTpl->fetch()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\response\jResponseHtml.class.php : 191
	2	jResponseHtml->output()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 204
	3	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-20 21:40:12	127.0.0.1	notice	2013-04-20 21:40:12	127.0.0.1	[8]	Trying to get property of non-object	C:\Program Files\EasyPHP-12.1\www\temp\Projet_ITI\www\compiled\templates\modules\Projet_ITI\AfficherAnnonces_html_t.php	50
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces
array (   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	template_49dcb02207c226ea7c0a9641618442f7()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTpl.class.php : 284
	1	jTpl->fetch()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\response\jResponseHtml.class.php : 191
	2	jResponseHtml->output()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 204
	3	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-20 21:40:12	127.0.0.1	notice	2013-04-20 21:40:12	127.0.0.1	[8]	Undefined index: COURANTANNONCES	C:\Program Files\EasyPHP-12.1\www\temp\Projet_ITI\www\compiled\templates\modules\Projet_ITI\AfficherAnnonces_html_t.php	50
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces
array (   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	template_49dcb02207c226ea7c0a9641618442f7()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTpl.class.php : 284
	1	jTpl->fetch()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\response\jResponseHtml.class.php : 191
	2	jResponseHtml->output()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 204
	3	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-20 21:40:12	127.0.0.1	notice	2013-04-20 21:40:12	127.0.0.1	[8]	Trying to get property of non-object	C:\Program Files\EasyPHP-12.1\www\temp\Projet_ITI\www\compiled\templates\modules\Projet_ITI\AfficherAnnonces_html_t.php	50
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces
array (   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	template_49dcb02207c226ea7c0a9641618442f7()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTpl.class.php : 284
	1	jTpl->fetch()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\response\jResponseHtml.class.php : 191
	2	jResponseHtml->output()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 204
	3	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:37:34	127.0.0.1	notice	2013-04-24 00:37:34	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=2
array (   'id_annonce' => '4',   'offset' => '2',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:37:34	127.0.0.1	notice	2013-04-24 00:37:34	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=2
array (   'id_annonce' => '4',   'offset' => '2',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:37:36	127.0.0.1	notice	2013-04-24 00:37:36	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=0
array (   'id_annonce' => '4',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:37:36	127.0.0.1	notice	2013-04-24 00:37:36	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=0
array (   'id_annonce' => '4',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:39:01	127.0.0.1	notice	2013-04-24 00:39:01	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=0
array (   'id_annonce' => '4',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:39:01	127.0.0.1	notice	2013-04-24 00:39:01	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=0
array (   'id_annonce' => '4',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:39:04	127.0.0.1	notice	2013-04-24 00:39:04	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?0=id_annonce&offset=0
array (   0 => 'id_annonce',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:39:04	127.0.0.1	notice	2013-04-24 00:39:04	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?0=id_annonce&offset=0
array (   0 => 'id_annonce',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:39:09	127.0.0.1	notice	2013-04-24 00:39:09	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?0=id_annonce&offset=2
array (   0 => 'id_annonce',   'offset' => '2',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:39:09	127.0.0.1	notice	2013-04-24 00:39:09	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?0=id_annonce&offset=2
array (   0 => 'id_annonce',   'offset' => '2',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:39:11	127.0.0.1	notice	2013-04-24 00:39:11	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?0=id_annonce&offset=0
array (   0 => 'id_annonce',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:39:11	127.0.0.1	notice	2013-04-24 00:39:11	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?0=id_annonce&offset=0
array (   0 => 'id_annonce',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:43:19	127.0.0.1	notice	2013-04-24 00:43:19	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?0=id_annonce&offset=0
array (   0 => 'id_annonce',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:43:19	127.0.0.1	notice	2013-04-24 00:43:19	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?0=id_annonce&offset=0
array (   0 => 'id_annonce',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:43:22	127.0.0.1	notice	2013-04-24 00:43:22	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=0
array (   'id_annonce' => '4',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:43:22	127.0.0.1	notice	2013-04-24 00:43:22	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=0
array (   'id_annonce' => '4',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:43:25	127.0.0.1	notice	2013-04-24 00:43:25	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=1
array (   'id_annonce' => '4',   'offset' => '1',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:43:25	127.0.0.1	notice	2013-04-24 00:43:25	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=1
array (   'id_annonce' => '4',   'offset' => '1',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:43:27	127.0.0.1	notice	2013-04-24 00:43:27	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=2
array (   'id_annonce' => '4',   'offset' => '2',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:43:27	127.0.0.1	notice	2013-04-24 00:43:27	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=2
array (   'id_annonce' => '4',   'offset' => '2',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:43:29	127.0.0.1	notice	2013-04-24 00:43:29	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=3
array (   'id_annonce' => '4',   'offset' => '3',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:43:29	127.0.0.1	notice	2013-04-24 00:43:29	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=3
array (   'id_annonce' => '4',   'offset' => '3',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:44:21	127.0.0.1	notice	2013-04-24 00:44:21	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=3
array (   'id_annonce' => '4',   'offset' => '3',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:44:21	127.0.0.1	notice	2013-04-24 00:44:21	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=3
array (   'id_annonce' => '4',   'offset' => '3',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:44:24	127.0.0.1	notice	2013-04-24 00:44:24	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=0
array (   'id_annonce' => '4',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 00:44:24	127.0.0.1	notice	2013-04-24 00:44:24	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	407
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=0
array (   'id_annonce' => '4',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 01:43:54	127.0.0.1	notice	2013-04-24 01:43:54	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$prenom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	423
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=0
array (   'id_annonce' => '4',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 01:43:54	127.0.0.1	notice	2013-04-24 01:43:54	127.0.0.1	[8]	Undefined property: jAuthDummyUser::$nom	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\modules\Projet_ITI\controllers\default.classic.php	423
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces?id_annonce=4&offset=0
array (   'id_annonce' => '4',   'offset' => '0',   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	defaultCtrl->afficherToutesLesAnnonces()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 195
	1	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 01:47:58	127.0.0.1	error	2013-04-24 01:47:58	127.0.0.1	[302]	In the template C:\Program Files\EasyPHP-12.1\www\Projet_ITI/modules/Projet_ITI/templates/AfficherAnnonces.tpl, unknown fonction int	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTplCompiler.class.php	703
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces
array (   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	jTplCompiler->doError1()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTplCompiler.class.php : 505
	1	jTplCompiler->_parseFunction()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTplCompiler.class.php : 291
	2	jTplCompiler->_callback()	[php] : 
	3	preg_replace_callback()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTplCompiler.class.php : 237
	4	jTplCompiler->compileContent()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTplCompiler.class.php : 191
	5	jTplCompiler->compileString()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTplCompiler.class.php : 181
	6	jTplCompiler->compile()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jIncluder.class.php : 103
	7	jIncluder::inc()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTpl.class.php : 250
	8	jTpl->getTemplate()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTpl.class.php : 202
	9	jTpl->meta()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\response\jResponseHtml.class.php : 190
	10	jResponseHtml->output()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 204
	11	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-24 01:48:53	127.0.0.1	error	2013-04-24 01:48:53	127.0.0.1	[302]	In the template C:\Program Files\EasyPHP-12.1\www\Projet_ITI/modules/Projet_ITI/templates/AfficherAnnonces.tpl, unknown fonction int	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTplCompiler.class.php	703
	/Projet_ITI/www/index.php/Projet_ITI/default/afficherToutesLesAnnonces
array (   'module' => 'Projet_ITI',   'action' => 'default:afficherToutesLesAnnonces', )

	0	jTplCompiler->doError1()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTplCompiler.class.php : 505
	1	jTplCompiler->_parseFunction()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTplCompiler.class.php : 291
	2	jTplCompiler->_callback()	[php] : 
	3	preg_replace_callback()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTplCompiler.class.php : 237
	4	jTplCompiler->compileContent()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTplCompiler.class.php : 191
	5	jTplCompiler->compileString()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTplCompiler.class.php : 181
	6	jTplCompiler->compile()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jIncluder.class.php : 103
	7	jIncluder::inc()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTpl.class.php : 250
	8	jTpl->getTemplate()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\tpl\jTpl.class.php : 202
	9	jTpl->meta()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\response\jResponseHtml.class.php : 190
	10	jResponseHtml->output()	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\core\jCoordinator.class.php : 204
	11	jCoordinator->process()	C:\Program Files\EasyPHP-12.1\www\Projet_ITI\www\index.php : 19


2013-04-29 16:45:15	127.0.0.1	error	2013-04-29 16:45:15	127.0.0.1	[804]	 unknown datatype required  on input (file C:\Program Files\EasyPHP-12.1\www\Projet_ITI/modules/Projet_ITI/forms/inscriptionUser.form.xml)	C:\Program Files\EasyPHP-12.1\www\jelix\lib\jelix\forms\jFormsCompiler_jf_1_0.class.php	343
